---
title: MaterialNode
classe: Autodesk.Revit.DB.MaterialNode
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.RenderNode
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# MaterialNode

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Color Color { get; }` | `materialNode.Color` | Color |
| `Int32 Glossiness { get; }` | `materialNode.Glossiness` | Int32 |
| `Boolean HasOverriddenAppearance { get; }` | `materialNode.HasOverriddenAppearance` | Boolean |
| `ElementId MaterialId { get; }` | `materialNode.MaterialId` | ElementId |
| `Int32 Smoothness { get; }` | `materialNode.Smoothness` | Int32 |
| `String ThumbnailFile { get; }` | `materialNode.ThumbnailFile` | String |
| `Double Transparency { get; }` | `materialNode.Transparency` | Double |
| `Asset GetAppearance()` | `materialNode.GetAppearance()` | Asset |
| `Asset GetAppearanceOverride()` | `materialNode.GetAppearanceOverride()` | Asset |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```